Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
     = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-qcFigures.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-qcFigures-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-qcFigures"
    }

  # module.svep[0].module.lambda-qcFigures.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-qcFigures-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-qcFigures"
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Running vcfstats for generating graphic."
      + function_name                  = "svep-backend-qcFigures"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 3000
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 10240
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryGTF/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/578165c317f7c01bd33503fe0dcefe3b736b30d73da1e8b027c00df8d899724a.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/svep/lambda/queryGTF'"
          + "filename_new"   = "builds/578165c317f7c01bd33503fe0dcefe3b736b30d73da1e8b027c00df8d899724a.zip"
          + "filename_old"   = "builds/578165c317f7c01bd33503fe0dcefe3b736b30d73da1e8b027c00df8d899724a.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryGTF"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryGTF"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryGTF-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:127214202110:log-group:/aws/lambda/svep-backend-queryGTF:*:*",
                          + "arn:aws:logs:*:127214202110:log-group:/aws/lambda/svep-backend-queryGTF:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-queryGTF"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryGTF",
        ]
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-queryGTF-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryGTF",
        ]
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-queryGTF"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Queries GTF for a specified VCF regions."
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-queryGTF"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 24
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/578165c317f7c01bd33503fe0dcefe3b736b30d73da1e8b027c00df8d899724a.zip"
        }
    }

  # module.svep[0].module.lambda-queryVCF.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryVCF/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/svep/lambda/queryVCF'"
          + "filename_new"   = "builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip"
          + "filename_old"   = "builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryVCF"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryVCF"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryVCF-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:127214202110:log-group:/aws/lambda/svep-backend-queryVCF:*:*",
                          + "arn:aws:logs:*:127214202110:log-group:/aws/lambda/svep-backend-queryVCF:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-queryVCF"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryVCF",
        ]
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-queryVCF-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryVCF",
        ]
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-queryVCF"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Invokes queryGTF for each region."
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-queryVCF"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip"
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryVCFsubmit/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/4e51b58c352ee156ae72a587687bb67b259c4427541d678cbd8ec2e43c7c8cbf.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/svep/lambda/queryVCFsubmit'"
          + "filename_new"   = "builds/4e51b58c352ee156ae72a587687bb67b259c4427541d678cbd8ec2e43c7c8cbf.zip"
          + "filename_old"   = "builds/4e51b58c352ee156ae72a587687bb67b259c4427541d678cbd8ec2e43c7c8cbf.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryVCFsubmit"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryVCFsubmit"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryVCFsubmit-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:127214202110:log-group:/aws/lambda/svep-backend-queryVCFsubmit:*:*",
                          + "arn:aws:logs:*:127214202110:log-group:/aws/lambda/svep-backend-queryVCFsubmit:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-queryVCFsubmit"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryVCFsubmit",
        ]
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-queryVCFsubmit-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryVCFsubmit",
        ]
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-queryVCFsubmit"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "This lambda will be called if there are too many batchids to be processed within"
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-queryVCFsubmit"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/4e51b58c352ee156ae72a587687bb67b259c4427541d678cbd8ec2e43c7c8cbf.zip"
        }
    }

  # module.svep[0].module.lambda-sendJobEmail.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-sendJobEmail/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/svep/lambda/sendJobEmail'"
          + "filename_new"   = "builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip"
          + "filename_old"   = "builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-sendJobEmail"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-sendJobEmail"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-sendJobEmail-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:127214202110:log-group:/aws/lambda/svep-backend-sendJobEmail:*:*",
                          + "arn:aws:logs:*:127214202110:log-group:/aws/lambda/svep-backend-sendJobEmail:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-sendJobEmail"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-sendJobEmail",
        ]
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-sendJobEmail-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-sendJobEmail",
        ]
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-sendJobEmail"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Invokes sendJobEmail to send email to user"
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-sendJobEmail"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip"
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-updateReferenceFiles"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-updateReferenceFiles"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-updateReferenceFiles-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-updateReferenceFiles"
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-updateReferenceFiles-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-updateReferenceFiles"
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Retrieves latest reference files and updates the reference bucket in S3"
      + filename                       = "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.zip"
      + function_name                  = "svep-backend-updateReferenceFiles"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 8192
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/updateReferenceFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.zip"
          + "timestamp" = "1748094515140361000"
        }
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] will be created
  + resource "aws_lambda_layer_version" "this" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + description                 = "python libraries"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "svep_backend_python_modules_layer"
      + s3_bucket                   = (known after apply)
      + s3_key                      = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
      + s3_object_version           = (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = "private"
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
      + storage_class          = "ONEZONE_IA"
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
          + "timestamp" = "1748094514906238000"
        }
    }

Plan: 1096 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + admin_login_command  = (known after apply)
  + api_url              = (known after apply)
  + beacon_ui_url        = (known after apply)
  + cognito_client_id    = (known after apply)
  + cognito_user_pool_id = (known after apply)
  + guest_login_command  = (known after apply)
module.sbeacon.null_resource.init_script: Creating...
module.sbeacon.null_resource.init_script: Provisioning with 'local-exec'...
module.sbeacon.null_resource.init_script (local-exec): Executing: ["/bin/sh" "-c" "bash init.sh"]
module.svep[0].null_resource.init_script: Creating...
module.svep[0].null_resource.init_script: Provisioning with 'local-exec'...
module.svep[0].null_resource.init_script (local-exec): Executing: ["/bin/sh" "-c" "bash init.sh"]
module.sbeacon.null_resource.init_script (local-exec): Running init.sh in sbeacon
module.svep[0].module.lambda-updateReferenceFiles.aws_cloudwatch_log_group.lambda[0]: Creating...
module.svep[0].module.lambda-pluginConsequence.aws_cloudwatch_log_group.lambda[0]: Creating...
module.svep[0].module.lambda-clearTempAndRegions.aws_cloudwatch_log_group.lambda[0]: Creating...
module.svep[0].module.lambda-qcFigures.aws_cloudwatch_log_group.lambda[0]: Creating...
module.sbeacon.null_resource.init_script (local-exec): + REPOSITORY_DIRECTORY=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/sbeacon
module.sbeacon.null_resource.init_script (local-exec): + LIBRARIES=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/sbeacon/libraries
module.sbeacon.null_resource.init_script (local-exec): + SOURCE=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/sbeacon/libraries/source
module.sbeacon.null_resource.init_script (local-exec): + '[' -d /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/sbeacon/libraries ']'
module.sbeacon.null_resource.init_script (local-exec): + rm -rf /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/sbeacon/libraries
module.svep[0].null_resource.init_script (local-exec): Running init.sh in sbeacon
module.svep[0].module.lambda-qcFigures.aws_cloudwatch_log_group.lambda[0]: Creation complete after 1s [id=/aws/lambda/svep-backend-qcFigures]
module.svep[0].null_resource.init_script (local-exec): + REPOSITORY_DIRECTORY=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/sbeacon
module.svep[0].null_resource.init_script (local-exec): + LIBRARIES=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/sbeacon/libraries
module.svep[0].null_resource.init_script (local-exec): + SOURCE=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/sbeacon/libraries/source
module.svep[0].null_resource.init_script (local-exec): + '[' -d /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/sbeacon/libraries ']'
module.svep[0].null_resource.init_script (local-exec): + rm -rf /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/sbeacon/libraries
module.svep[0].module.docker_image_qcFigures_lambda.aws_ecr_repository.this[0]: Creating...
module.svep[0].aws_s3_bucket.svep-references: Creating...
module.svep[0].module.docker_image_pluginConsequence_lambda.aws_ecr_repository.this[0]: Creating...
module.svep[0].aws_s3_bucket.svep-temp: Creating...
module.svep[0].aws_dynamodb_table.svep_references: Creating...
module.svep[0].aws_s3_bucket.svep-results: Creating...
module.svep[0].aws_api_gateway_rest_api.VPApi: Creating...
module.svep[0].aws_s3_bucket.lambda-layers-bucket: Creating...
module.svep[0].module.docker_image_qcFigures_lambda.aws_ecr_repository.this[0]: Creation complete after 0s [id=svep-qcfigures-lambda-containers]
module.svep[0].aws_sns_topic.queryGTF: Creating...
module.svep[0].null_resource.init_script (local-exec): + mkdir /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/sbeacon/libraries
module.sbeacon.null_resource.init_script (local-exec): + mkdir /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/sbeacon/libraries
module.svep[0].null_resource.init_script (local-exec): + mkdir /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/sbeacon/libraries/source
module.sbeacon.null_resource.init_script (local-exec): mkdir: cannot create directory ‘/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/sbeacon/libraries’: File exists
module.sbeacon.null_resource.init_script (local-exec): Running init.sh in svep
module.sbeacon.null_resource.init_script (local-exec): ++ REPOSITORY_DIRECTORY=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/svep
module.sbeacon.null_resource.init_script (local-exec): ++ LIBRARIES=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/svep/libraries
module.sbeacon.null_resource.init_script (local-exec): ++ SOURCE=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/svep/libraries/source
module.sbeacon.null_resource.init_script (local-exec): ++ '[' -d /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/svep/libraries ']'
module.sbeacon.null_resource.init_script (local-exec): ++ rm -rf /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/svep/libraries
module.svep[0].null_resource.init_script (local-exec): + cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/sbeacon/libraries/source
module.svep[0].null_resource.init_script (local-exec): + wget https://github.com/samtools/htslib/releases/download/1.21/htslib-1.21.tar.bz2
module.svep[0].null_resource.init_script (local-exec): --2025-05-24 20:49:04--  https://github.com/samtools/htslib/releases/download/1.21/htslib-1.21.tar.bz2
module.svep[0].aws_sns_topic.queryVCFsubmit: Creating...
module.svep[0].aws_sns_topic.queryGTF: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryGTF]
module.svep[0].aws_sns_topic.queryVCF: Creating...
module.svep[0].aws_sns_topic.queryVCFsubmit: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCFsubmit]
module.svep[0].aws_sns_topic.pluginClinvar: Creating...
module.svep[0].aws_sns_topic.queryVCF: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCF]
module.svep[0].aws_sns_topic.concat: Creating...
module.sbeacon.null_resource.init_script (local-exec): ++ mkdir /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/svep/libraries
module.sbeacon.null_resource.init_script (local-exec): ++ mkdir /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/svep/libraries/source
module.sbeacon.null_resource.init_script (local-exec): ++ cd /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/173/default/svep/libraries/source
module.sbeacon.null_resource.init_script (local-exec): ++ wget https://github.com/samtools/htslib/releases/download/1.21/htslib-1.21.tar.bz2
module.sbeacon.null_resource.init_script (local-exec): --2025-05-24 20:49:05--  https://github.com/samtools/htslib/releases/download/1.21/htslib-1.21.tar.bz2
module.svep[0].aws_sns_topic.pluginClinvar: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginClinvar]
module.svep[0].aws_sns_topic.updateReferenceFiles: Creating...
module.svep[0].null_resource.init_script (local-exec): Resolving github.com (github.com)... 20.205.243.166
module.svep[0].null_resource.init_script (local-exec): Connecting to github.com (github.com)|20.205.243.166|:443... connected.
module.svep[0].aws_sns_topic.concat: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concat]
module.svep[0].aws_cloudfront_cache_policy.api: Creating...
module.sbeacon.null_resource.init_script (local-exec): Resolving github.com (github.com)... 20.205.243.166
module.sbeacon.null_resource.init_script (local-exec): Connecting to github.com (github.com)|20.205.243.166|:443... connected.
module.svep[0].aws_sns_topic.updateReferenceFiles: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-updateReferenceFiles]
module.svep[0].aws_sns_topic.createPages: Creating...
module.svep[0].aws_sns_topic.createPages: Creation complete after 1s [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-createPages]
module.svep[0].aws_sns_topic.pluginGnomad: Creating...
module.svep[0].null_resource.init_script (local-exec): HTTP request sent, awaiting response...
module.sbeacon.null_resource.init_script (local-exec): HTTP request sent, awaiting response...
module.svep[0].aws_sns_topic.pluginGnomad: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginGnomad]
module.svep[0].aws_sns_topic.concatPages: Creating...
module.sbeacon.null_resource.init_script (local-exec): 302 Found
module.sbeacon.null_resource.init_script (local-exec): Location: https://objects.githubusercontent.com/github-production-release-asset-2e65be/4339773/1f06aaea-0e5f-4fc6-a163-183b6066bf35?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=releaseassetproduction%2F20250524%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20250524T134905Z&X-Amz-Expires=300&X-Amz-Signature=461a758be78cbc33f58e6cbd056ee7332bd6cf8878c116a695a7b7313b40d432&X-Amz-SignedHeaders=host&response-content-disposition=attachment%3B%20filename%3Dhtslib-1.21.tar.bz2&response-content-type=application%2Foctet-stream [following]
module.sbeacon.null_resource.init_script (local-exec): --2025-05-24 20:49:05--  https://objects.githubusercontent.com/github-production-release-asset-2e65be/4339773/1f06aaea-0e5f-4fc6-a163-183b6066bf35?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=releaseassetproduction%2F20250524%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20250524T134905Z&X-Amz-Expires=300&X-Amz-Signature=461a758be78cbc33f58e6cbd056ee7332bd6cf8878c116a695a7b7313b40d432&X-Amz-SignedHeaders=host&response-content-disposition=attachment%3B%20filename%3Dhtslib-1.21.tar.bz2&response-content-type=application%2Foctet-stream
module.svep[0].null_resource.init_script (local-exec): 302 Found
module.svep[0].null_resource.init_script (local-exec): Location: https://objects.githubusercontent.com/github-production-release-asset-2e65be/4339773/1f06aaea-0e5f-4fc6-a163-183b6066bf35?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=releaseassetproduction%2F20250524%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20250524T134905Z&X-Amz-Expires=300&X-Amz-Signature=461a758be78cbc33f58e6cbd056ee7332bd6cf8878c116a695a7b7313b40d432&X-Amz-SignedHeaders=host&response-content-disposition=attachment%3B%20filename%3Dhtslib-1.21.tar.bz2&response-content-type=application%2Foctet-stream [following]
module.svep[0].null_resource.init_script (local-exec): --2025-05-24 20:49:05--  https://objects.githubusercontent.com/github-production-release-asset-2e65be/4339773/1f06aaea-0e5f-4fc6-a163-183b6066bf35?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=releaseassetproduction%2F20250524%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20250524T134905Z&X-Amz-Expires=300&X-Amz-Signature=461a758be78cbc33f58e6cbd056ee7332bd6cf8878c116a695a7b7313b40d432&X-Amz-SignedHeaders=host&response-content-disposition=attachment%3B%20filename%3Dhtslib-1.21.tar.bz2&response-content-type=application%2Foctet-stream
module.sbeacon.null_resource.init_script (local-exec): Resolving objects.githubusercontent.com (objects.githubusercontent.com)... 185.199.109.133, 185.199.110.133, 185.199.111.133, ...
module.svep[0].null_resource.init_script (local-exec): Resolving objects.githubusercontent.com (objects.githubusercontent.com)... 185.199.108.133, 185.199.111.133, 185.199.110.133, ...
module.sbeacon.null_resource.init_script (local-exec): Connecting to objects.githubusercontent.com (objects.githubusercontent.com)|185.199.109.133|:443... connected.
module.svep[0].null_resource.init_script (local-exec): Connecting to objects.githubusercontent.com (objects.githubusercontent.com)|185.199.108.133|:443... connected.
module.svep[0].aws_sns_topic.concatPages: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concatPages]
module.svep[0].aws_cloudwatch_event_rule.update_references_trigger: Creating...
module.svep[0].aws_cloudwatch_event_rule.update_references_trigger: Creation complete after 0s [id=svep_update_references_trigger]
module.svep[0].aws_api_gateway_rest_api.VPApi: Creation complete after 1s [id=49hervuih0]
module.svep[0].aws_sns_topic.formatOutput: Creating...
module.svep[0].aws_sns_topic.sendJobEmail: Creating...
module.sbeacon.null_resource.init_script (local-exec): HTTP request sent, awaiting response...
module.svep[0].null_resource.init_script (local-exec): HTTP request sent, awaiting response...
module.svep[0].aws_sns_topic.sendJobEmail: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail]
module.svep[0].aws_sns_topic.pluginConsequence: Creating...
module.svep[0].aws_sns_topic.formatOutput: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-formatOutput]
module.svep[0].aws_cloudfront_origin_request_policy.api: Creating...
module.sbeacon.null_resource.init_script (local-exec): 200 OK
module.sbeacon.null_resource.init_script (local-exec): Length: 4781943 (4.6M) [application/octet-stream]
module.sbeacon.null_resource.init_script (local-exec): Saving to: ‘htslib-1.21.tar.bz2’

module.sbeacon.null_resource.init_script (local-exec):      0K .......... .......... .......... .......... ..........  1% 2.66M 2s
module.sbeacon.null_resource.init_script (local-exec):     50K .......... .......... .......... .......... ..........  2% 3.48M 1s
module.sbeacon.null_resource.init_script (local-exec):    100K .......... .......... .......... .......... ..........  3% 14.3M 1s
module.sbeacon.null_resource.init_script (local-exec):    150K .......... .......... .......... .......... ..........  4% 14.5M 1s
module.sbeacon.null_resource.init_script (local-exec):    200K .......... .......... .......... .......... ..........  5% 5.55M 1s
module.sbeacon.null_resource.init_script (local-exec):    250K .......... .......... .......... .......... ..........  6% 20.4M 1s
module.svep[0].aws_sns_topic.pluginConsequence: Creation complete after 0s [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginConsequence]
module.sbeacon.null_resource.init_script (local-exec):    300K .......... .......... .......... .......... ..........  7% 33.7M 1s
module.sbeacon.null_resource.init_script (local-exec):    350K .......... .......... .......... .......... ..........  8% 31.1M 1s
module.sbeacon.null_resource.init_script (local-exec):    400K .......... .......... .......... .......... ..........  9% 22.7M 1s
module.svep[0].aws_s3_bucket.svep-regions: Creating...
module.sbeacon.null_resource.init_script (local-exec):    450K .......... .......... .......... .......... .......... 10% 5.85M 1s
module.sbeacon.null_resource.init_script (local-exec):    500K .......... .......... .......... .......... .......... 11%  107M 0s
module.sbeacon.null_resource.init_script (local-exec):    550K .......... .......... .......... .......... .......... 12% 22.6M 0s
module.sbeacon.null_resource.init_script (local-exec):    600K .......... .......... .......... .......... .......... 13%  255M 0s
module.sbeacon.null_resource.init_script (local-exec):    650K .......... .......... .......... .......... .......... 14% 37.1M 0s
module.sbeacon.null_resource.init_script (local-exec):    700K .......... .......... .......... .......... .......... 16% 45.6M 0s
module.sbeacon.null_resource.init_script (local-exec):    750K .......... .......... .......... .......... .......... 17%  262M 0s
module.sbeacon.null_resource.init_script (local-exec):    800K .......... .......... .......... .......... .......... 18% 42.8M 0s
module.sbeacon.null_resource.init_script (local-exec):    850K .......... .......... .......... .......... .......... 19% 50.0M 0s
module.sbeacon.null_resource.init_script (local-exec):    900K .......... .......... .......... .......... .......... 20% 58.0M 0s
module.sbeacon.null_resource.init_script (local-exec):    950K .......... .......... .......... .......... .......... 21%  288M 0s
module.sbeacon.null_resource.init_script (local-exec):   1000K .......... .......... .......... .......... .......... 22% 6.32M 0s
module.sbeacon.null_resource.init_script (local-exec):   1050K .......... .......... .......... .......... .......... 23%  245M 0s
module.sbeacon.null_resource.init_script (local-exec):   1100K .......... .......... .......... .......... .......... 24% 54.9M 0s
module.sbeacon.null_resource.init_script (local-exec):   1150K .......... .......... .......... .......... .......... 25%  190M 0s
module.sbeacon.null_resource.init_script (local-exec):   1200K .......... .......... .......... .......... .......... 26%  103M 0s
module.sbeacon.null_resource.init_script (local-exec):   1250K .......... .......... .......... .......... .......... 27% 61.8M 0s
module.sbeacon.null_resource.init_script (local-exec):   1300K .......... .......... .......... .......... .......... 28% 76.2M 0s
module.sbeacon.null_resource.init_script (local-exec):   1350K .......... .......... .......... .......... .......... 29% 73.7M 0s
module.sbeacon.null_resource.init_script (local-exec):   1400K .......... .......... .......... .......... .......... 31%  224M 0s
module.sbeacon.null_resource.init_script (local-exec):   1450K .......... .......... .......... .......... .......... 32%  109M 0s
module.sbeacon.null_resource.init_script (local-exec):   1500K .......... .......... .......... .......... .......... 33% 73.2M 0s
module.sbeacon.null_resource.init_script (local-exec):   1550K .......... .......... .......... .......... .......... 34% 52.1M 0s
module.sbeacon.null_resource.init_script (local-exec):   1600K .......... .......... .......... .......... .......... 35%  132M 0s
module.sbeacon.null_resource.init_script (local-exec):   1650K .......... .......... .......... .......... .......... 36%  170M 0s
module.sbeacon.null_resource.init_script (local-exec):   1700K .......... .......... .......... .......... .......... 37%  251M 0s
module.sbeacon.null_resource.init_script (local-exec):   1750K .......... .......... .......... .......... .......... 38% 84.1M 0s
module.sbeacon.null_resource.init_script (local-exec):   1800K .......... .......... .......... .......... .......... 39%  115M 0s
module.sbeacon.null_resource.init_script (local-exec):   1850K .......... .......... .......... .......... .......... 40%  105M 0s
module.sbeacon.null_resource.init_script (local-exec):   1900K .......... .......... .......... .......... .......... 41%  411M 0s
module.sbeacon.null_resource.init_script (local-exec):   1950K .......... .......... .......... .......... .......... 42%  121M 0s
mod
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.